DataProcessors/ВыгрузкаGUID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаGUID</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьGUID</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВыгрузкаGUID/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		Результат = Запрос.Выполнить().Выгрузить();
		Объект.ТабличнаяЧастьGUID.Очистить();
		Для Каждого стр Из Результат Цикл
			НовСтрока = Объект.ТабличнаяЧастьGUID.Добавить();
			НовСтрока.ЛицевойСчет = стр.ЛицевойСчет;
			НовСтрока.GUID = Строка(стр.ЛицевойСчет.УникальныйИдентификатор());
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА И ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
		Результат = Запрос.Выполнить().Выгрузить();
		Объект.ТабличнаяЧастьGUID.Очистить();
		Для Каждого стр Из Результат Цикл
			НовСтрока = Объект.ТабличнаяЧастьGUID.Добавить();
			НовСтрока.ЛицевойСчет = стр.ЛицевойСчет;
			НовСтрока.GUID = Строка(стр.ЛицевойСчет.УникальныйИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
